[
	{
		"company": "EQUITAS Life Sciences",
		"title": "Software Engineer, July 2018-June 2020",
		"description": "Produced interactive web-based software using React, Node Express, TypeScript, Postgres and other technologies. Collaborated with engineering team to create and evolve e-learning solutions, a sales presentation generator, and a coaching mentorship application. Trained and guided interns new to software development."
	},
	{
		"company": "Meredith Content Licensing",
		"title": "Lead Front End Developer, November 2014-July 2018",
		"description": "Built and maintained embedded JavaScript application delivering high quality food-related content. Enabled streamlined delivery by designing solutions that are easily configurable and themeable for new clients. Assisted in developing product road map. Served as tech lead for JavaScript development team using Scrum methodology."
	},
	{
		"company": "MyWebGrocer",
		"title": "UI Engineer, October 2013-November 2014",
		"description": "Created customer-facing ecommerce features for national grocery store chains using HTML, JavaScript, Knockout.js, and Sass. Developed and maintained a REST-driven single-page application built with modular, testable JavaScript. Collaborated with cross-functional team members to deliver web software in an Agile environment. "
	},
	{
		"company": "Recreational Equipment, Inc.",
		"title": "Front End Web Developer, July 2012-October 2013",
		"description": "Developed site components for REI.com in the Adobe CQ5 CMS using JSP/JSTL, HTML, CSS, and JavaScript. Collaborated with Java Developers, UX Designers, Interaction Designers, Online Editors, Analysts, and Product Owners to deliver rich, authorable content management tools using Agile methodology."
	},
	{
		"company": "Recreational Equipment, Inc.",
		"title": "Technical Producer, July 2009-July 2012",
		"description": "Built and maintained front end web content for REI.com. Created dynamic, interactive landing experiences, sales promotions, and was responsible for functionality on the REI.com homepage. Used latest client-side technologies and web API to implement rich customer experiences. Leveraged XML and JSON from web services. Ensured accurate analytics data was captured using REI's custom implementation of Omniture Site Catalyst. Executed multi-variant testing using Omniture Test & Target."
	},
	{
		"company": "Tire Swing, LLC.",
		"title": "Co-Founder, June 2008-2018",
		"description": "Designed and implemented web solutions for small businesses and organizations. Produced dynamic, interactive websites using HTML/CSS, JavaScript, jQuery, Flash, and PHP/MYSQL. Implemented CMS support using Wordpress and Joomla. Created graphics using Photoshop and Illustrator. Designed and developed company website. Procured projects and developed client base through networking, marketing, and word of mouth."
	}
]